ox_docs/cs/computer_security/KBhCS240ThreatModelingAssignment.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-26 Sun 09:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Threat Modeling Assignment</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Houjun Liu" />
<link rel="stylesheet" href="https://taproot3.sanity.gq/global.css" type="text/css"/>
</head>
<body>
<div id="preamble" class="status">
<div class="header"><span class="site"><a href="https://taproot3.sanity.gq">TR3.5</a></span></div><div class="datarow"><h1 class="title">Threat Modeling Assignment</h1> <h2 class="subtitle"></h2> <span class="author">Houjun Liu</span> <span class="date">2021-09-11 Sat 16:34</date></div>
</div>
<div id="content">
<h1 class="title">Threat Modeling Assignment</h1>
<p>
The assignment is centered around <a href="https://www.condution.com/">Condution</a>, an open-source task management platform. Data processing and querying is done on-device, but raw user tables and data is stored in a remote PosgreSQL server that's either officially hosted and supported or optionally on-prem hosted by the user.
</p>

<div id="outline-container-org5a0c8c6" class="outline-2">
<h2 id="org5a0c8c6"><span class="section-number-2">1</span> What are we protecting?</h2>
<div class="outline-text-2" id="text-1">
<p>
Because of the open-source nature of Condution, and the fact that all data processing code is done with the client application, the most important asset to actually protect is any user's data (tasks, perspectives, due dates, etc.).
</p>

<p>
This means creating a secure pipeline between our servers and that of the clients, that from self-hosted servers and that of their clients, and finally the clients themselves.
</p>

<p>
The scope of Condution is has too narrow scope to protect anyone but direct Condution user's data, including misuses of the client app or API but not including users of a third-party services with indirect API interfaces to Condution.
</p>
</div>
</div>

<div id="outline-container-orgb31628e" class="outline-2">
<h2 id="orgb31628e"><span class="section-number-2">2</span> Who are we protecting it from, and what are their motivations?</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org421ca9b" class="outline-3">
<h3 id="org421ca9b"><span class="section-number-3">2.1</span> Protecting from&#x2026;</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Advertisers who may want to advertise based on notes of users</li>
<li>Foreign companies and groups who are attempting to access privileged information</li>
<li>Bad actors looking to leverage a "weak-point" in a user's security profile</li>
<li>Well-meaning but security-unconscious users</li>
</ul>
</div>
</div>

<div id="outline-container-org4a5f70b" class="outline-3">
<h3 id="org4a5f70b"><span class="section-number-3">2.2</span> Not Protecting from&#x2026;</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Organized, state-supported exploits</li>
<li>Third party authorization and our hosting partners (AWS S3)</li>
<li>Intentional, non-data leaking misuses (DDOS; creating fake accounts, etc.)</li>
<li>Authorized third-party access without prior credential-sharing</li>
</ul>

<p>
As the on-site hosting and UI is the primary service that Condution is providing, it is not useful to divert time in preventing the intentional or accidentally shutdown of the reference server. Although, it is useful to use services like Cloudflare as a no-effort prevention for such attacks.
</p>

<p>
Also, user data is also locally backed up. Hence, it is possible to restore services by simply hosting another instance and restoring data.
</p>
</div>
</div>
</div>

<div id="outline-container-org76f1c7f" class="outline-2">
<h2 id="org76f1c7f"><span class="section-number-2">3</span> What methods of attacks do we prevent?</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org114fc90" class="outline-3">
<h3 id="org114fc90"><span class="section-number-3">3.1</span> Software Attacks</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Software attacks mostly center around attacking the user-facing (both server and client) software and exposing its vulnerabilities.
</p>

<ul class="org-ul">
<li>Auth pipeline password cracking</li>
<li>Cross-site cookie sniffing</li>
<li>XSS</li>
<li>UI design injection to gain protected features</li>
<li>Tampering with self-hosted server authentication UI</li>
</ul>
</div>
</div>

<div id="outline-container-orge2da702" class="outline-3">
<h3 id="orge2da702"><span class="section-number-3">3.2</span> Pipeline Attacks</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Pipeline attacks mostly interfere with our DevOps pipeline to gain unauthorized access.
</p>

<ul class="org-ul">
<li>Breaching of PAM on our pipeline (once it gets to AWS IAM, its their problem)</li>
<li>Breaching keys and cookies for our deployment system</li>
<li>Breaching access points to Continuous Delivery workflow</li>
<li>Leaking signing keys</li>
</ul>
</div>
</div>

<div id="outline-container-org4bee027" class="outline-3">
<h3 id="org4bee027"><span class="section-number-3">3.3</span> Social Attacks</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Social attacks work on hijacking user's information by exposing social vulnerabilities of the user.
</p>

<ul class="org-ul">
<li>Security misinformation and "hacks" distributed over the internet (like self-XSS via the JavaScript Console)</li>
<li>Weak passwords that exacerbate the problems above</li>
<li>Issues with the storage of user passwords and cookies (i.e. accidentally committing all of <code>.config</code>, which would therefore contain Chromium cookies)</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org65ed50d" class="outline-2">
<h2 id="org65ed50d"><span class="section-number-2">4</span> What are the possible effects of these attacks</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>Digital or physical harm to users via leaking of privileged information</li>
<li>Digital or physical harm to those whom the users interact with (say, lawyers) via the leaking of privileged information</li>
<li>Loss of trust in the Condution platform and ecosystem</li>
<li>Breaking of data privacy laws like CCPA or GDPR</li>
</ol>
</div>
</div>

<div id="outline-container-org6445bea" class="outline-2">
<h2 id="org6445bea"><span class="section-number-2">5</span> What are the resources of the attackers</h2>
<div class="outline-text-2" id="text-5">
<p>
The attacker's resources are primarily limited.
</p>

<p>
Because of the fact that we are limiting our scope to non-organisational non-nation-state attacks, and the fact that the net value of user data &#x2014; although important &#x2014; is very low, the attacks will probably be limited in scope.
</p>

<ul class="org-ul">
<li>Advertisers: the value of random user data is reasonably low, so they will likely only engage in low-effort systems-wide attacks but not much of specific, targeted attacks</li>
<li>Foreign companies and groups who are attempting to access privileged information: the value of this is very high, depending what the informational content is. However, there are likely better sources of attacks than the partial and fragmented to-do list system</li>
<li>Bad actors looking to leverage a "weak-point" in a user's security profile: this attack likely has very low effort due to the fact that this process casts a generally large net and exposes very shallow vulnerabilities</li>
<li>Well-meaning but security-unconscious users: no value nor tangiable resources</li>
</ul>
</div>
</div>

<div id="outline-container-orge355552" class="outline-2">
<h2 id="orge355552"><span class="section-number-2">6</span> What are our resources?</h2>
<div class="outline-text-2" id="text-6">
<p>
Directly accessible resources are reasonably limited: have 8 engineers on all departments, limited cybersecurity experience, and only freely or cheaply available commercial tools for PAM, authentication, or security.
</p>

<p>
However, it is possible &#x2014; in cases with pipeline leaks and database security breaches &#x2014; to request emergency help from AWS and GCP. Due to the fact that our interests generally align with theirs with respect to user data safety, they already have systems in place to perform emergency triage and freeze data to protect security.
</p>
</div>
</div>

<div id="outline-container-orga3bd4fd" class="outline-2">
<h2 id="orga3bd4fd"><span class="section-number-2">7</span> What should we do?</h2>
<div class="outline-text-2" id="text-7">
<ol class="org-ol">
<li>Align and protect resources and partnerships with hosting services to allow emergency triage</li>
<li>Secure CI/CD pipelines and update services to authorized users, with two-factor PAM authentication</li>
<li>Implement warnings and education for password security (forcing users to choose more secure passwords, providing self XSS warnings in the console, etc.)</li>
<li>Create systems for data shutdown, reversal, and freezing in case of emergency and to comply with privacy laws</li>
<li>Scan for cookie signatures on the internet (via security services like Pingdom) to analyze for public leaks of user security information</li>
</ol>
</div>
</div>
</div>
</body>
</html>
