docs/cs/computer_security/KBhCS240ThreatModelingAssignment.tex
% Created 2021-09-27 Mon 11:52
% Intended LaTeX compiler: xelatex
\documentclass[letterpaper]{article}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\setlength{\parindent}{0pt}
\usepackage[margin=1in]{geometry}
\usepackage{fontspec}
\usepackage{svg}
\usepackage{cancel}
\usepackage{indentfirst}
\setmainfont[ItalicFont = LiberationSans-Italic, BoldFont = LiberationSans-Bold, BoldItalicFont = LiberationSans-BoldItalic]{LiberationSans}
\newfontfamily\NHLight[ItalicFont = LiberationSansNarrow-Italic, BoldFont       = LiberationSansNarrow-Bold, BoldItalicFont = LiberationSansNarrow-BoldItalic]{LiberationSansNarrow}
\newcommand\textrmlf[1]{{\NHLight#1}}
\newcommand\textitlf[1]{{\NHLight\itshape#1}}
\let\textbflf\textrm
\newcommand\textulf[1]{{\NHLight\bfseries#1}}
\newcommand\textuitlf[1]{{\NHLight\bfseries\itshape#1}}
\usepackage{fancyhdr}
\pagestyle{fancy}
\usepackage{titlesec}
\usepackage{titling}
\makeatletter
\lhead{\textbf{\@title}}
\makeatother
\rhead{\textrmlf{Compiled} \today}
\lfoot{\theauthor\ \textbullet \ \textbf{2021-2022}}
\cfoot{}
\rfoot{\textrmlf{Page} \thepage}
\renewcommand{\tableofcontents}{}
\titleformat{\section} {\Large} {\textrmlf{\thesection} {|}} {0.3em} {\textbf}
\titleformat{\subsection} {\large} {\textrmlf{\thesubsection} {|}} {0.2em} {\textbf}
\titleformat{\subsubsection} {\large} {\textrmlf{\thesubsubsection} {|}} {0.1em} {\textbf}
\setlength{\parskip}{0.45em}
\renewcommand\maketitle{}
\author{Houjun Liu}
\date{\today}
\title{Threat Modeling Assignment}
\hypersetup{
 pdfauthor={Houjun Liu},
 pdftitle={Threat Modeling Assignment},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.50 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

The assignment is centered around \href{https://www.condution.com/}{Condution}, an open-source task management platform. Data processing and querying is done on-device, but raw user tables and data is stored in a remote PosgreSQL server that's either officially hosted and supported or optionally on-prem hosted by the user.

\section{What are we protecting?}
\label{sec:orgd654587}
Because of the open-source nature of Condution, and the fact that all data processing code is done with the client application, the most important asset to actually protect is any user's data (tasks, perspectives, due dates, etc.).

This means creating a secure pipeline between our servers and that of the clients, that from self-hosted servers and that of their clients, and finally the clients themselves.

The scope of Condution is has too narrow scope to protect anyone but direct Condution user's data, including misuses of the client app or API but not including users of a third-party services with indirect API interfaces to Condution.

\section{Who are we protecting it from, and what are their motivations?}
\label{sec:orgba7bff2}

\subsection{Protecting from\ldots{}}
\label{sec:orgce846ca}
\begin{itemize}
\item Advertisers who may want to advertise based on notes of users
\item Foreign companies and groups who are attempting to access privileged information
\item Bad actors looking to leverage a "weak-point" in a user's security profile
\item Well-meaning but security-unconscious users
\end{itemize}

\subsection{Not Protecting from\ldots{}}
\label{sec:orga44f7e1}
\begin{itemize}
\item Organized, state-supported exploits
\item Third party authorization and our hosting partners (AWS S3)
\item Intentional, non-data leaking misuses (DDOS; creating fake accounts, etc.)
\item Authorized third-party access without prior credential-sharing
\end{itemize}

As the on-site hosting and UI is the primary service that Condution is providing, it is not useful to divert time in preventing the intentional or accidentally shutdown of the reference server. Although, it is useful to use services like Cloudflare as a no-effort prevention for such attacks.

Also, user data is also locally backed up. Hence, it is possible to restore services by simply hosting another instance and restoring data.

\section{What methods of attacks do we prevent?}
\label{sec:org925a0df}

\subsection{Software Attacks}
\label{sec:org8136918}
Software attacks mostly center around attacking the user-facing (both server and client) software and exposing its vulnerabilities.

\begin{itemize}
\item Auth pipeline password cracking
\item Cross-site cookie sniffing
\item XSS
\item UI design injection to gain protected features
\item Tampering with self-hosted server authentication UI
\end{itemize}

\subsection{Pipeline Attacks}
\label{sec:orgba5d578}
Pipeline attacks mostly interfere with our DevOps pipeline to gain unauthorized access.

\begin{itemize}
\item Breaching of PAM on our pipeline (once it gets to AWS IAM, its their problem)
\item Breaching keys and cookies for our deployment system
\item Breaching access points to Continuous Delivery workflow
\item Leaking signing keys
\end{itemize}

\subsection{Social Attacks}
\label{sec:orgb7976e9}
Social attacks work on hijacking user's information by exposing social vulnerabilities of the user.

\begin{itemize}
\item Security misinformation and "hacks" distributed over the internet (like self-XSS via the JavaScript Console)
\item Weak passwords that exacerbate the problems above
\item Issues with the storage of user passwords and cookies (i.e. accidentally committing all of \texttt{.config}, which would therefore contain Chromium cookies)
\end{itemize}

\section{What are the possible effects of these attacks}
\label{sec:org6e7cd62}
\begin{enumerate}
\item Digital or physical harm to users via leaking of privileged information
\item Digital or physical harm to those whom the users interact with (say, lawyers) via the leaking of privileged information
\item Loss of trust in the Condution platform and ecosystem
\item Breaking of data privacy laws like CCPA or GDPR
\end{enumerate}

\section{What are the resources of the attackers}
\label{sec:org1a2bdca}
The attacker's resources are primarily limited.

Because of the fact that we are limiting our scope to non-organisational non-nation-state attacks, and the fact that the net value of user data --- although important --- is very low, the attacks will probably be limited in scope.

\begin{itemize}
\item Advertisers: the value of random user data is reasonably low, so they will likely only engage in low-effort systems-wide attacks but not much of specific, targeted attacks
\item Foreign companies and groups who are attempting to access privileged information: the value of this is very high, depending what the informational content is. However, there are likely better sources of attacks than the partial and fragmented to-do list system
\item Bad actors looking to leverage a "weak-point" in a user's security profile: this attack likely has very low effort due to the fact that this process casts a generally large net and exposes very shallow vulnerabilities
\item Well-meaning but security-unconscious users: no value nor tangiable resources
\end{itemize}

\section{What are our resources?}
\label{sec:org2fe6bd5}
Directly accessible resources are reasonably limited: have 8 engineers on all departments, limited cybersecurity experience, and only freely or cheaply available commercial tools for PAM, authentication, or security.

However, it is possible --- in cases with pipeline leaks and database security breaches --- to request emergency help from AWS and GCP. Due to the fact that our interests generally align with theirs with respect to user data safety, they already have systems in place to perform emergency triage and freeze data to protect security.

\section{What should we do?}
\label{sec:org09820cb}
\begin{enumerate}
\item Align and protect resources and partnerships with hosting services to allow emergency triage
\item Secure CI/CD pipelines and update services to authorized users, with two-factor PAM authentication
\item Implement warnings and education for password security (forcing users to choose more secure passwords, providing self XSS warnings in the console, etc.)
\item Create systems for data shutdown, reversal, and freezing in case of emergency and to comply with privacy laws
\item Scan for cookie signatures on the internet (via security services like Pingdom) to analyze for public leaks of user security information
\end{enumerate}
\end{document}
